# 1.什么是爬虫？
# 互联网相当于一张蜘蛛网 我们抓取互联网信息的程序
#   就像是游走在网上的小虫子 所以称之为爬虫
# 2.爬虫的作用 \为什么要爬虫
#   1.获取信息 填充数据到自己的服务器（头条）
#   2.获取关键信息 进行商业分析 市场评估
#   3.浏览器
# 3.爬虫的分类
#   1.通用爬虫 ：全部获取
#   2.聚焦爬虫（主要学习） ：只取自己想要的
# 4.爬虫的准备
#   1.firefox , google
#   2.charles
#   3.了解http通信协议以及数据请求过程
# 5.互联网之http协议
#   http
#   https
#   file:/ 找本机的电脑文件 用的是file:/
#   ftp:共享协议
#   http://www.baidu.com
#   http 后面的内容为“域名”
#   域名的实质：IP地址
#   DNS域名系统 将IP地址和域名对应起来
#   ipv4 :4组3位数字组成  42亿 全球ip
#   ip分类：
#   静态ip：网站的ip必须为静态ip
#   动态ip：
#   ipv6
#
# 前端和后端的概念：
# 前端：直接和用户进行交互 app 网页
# 后端：数据 服务器
#
# 服务器
# 服务器分类有两种
# 1.硬件服务器 ： 理论上审核电脑都可以当做一个服务器
# 2.软件服务器 ： 服务器代码
#
# 黑客
# 骇客

